# Taps
tap "cloudfleetai/tap"
tap "ddev/ddev"
tap "go-task/tap"
tap "jesseduffield/lazygit"

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew "curl"
brew 'coreutils' # Those that come with macOS are outdated
brew 'eza'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew "gtk+3"
brew 'grep'
brew "hcloud"
brew "http-server"
brew "httpd"
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew "kubernetes-cli"
brew "lazygit"
brew 'mackup'
brew 'mas' # Mac App Store manager
brew "mkcert"
brew "ohdear-cli"
brew "openssl@3"
brew "pandoc"
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew "qrtool"
brew "s3cmd"
brew "sendme"
brew "speedtest-cli"
brew "sqlite"
brew 'svn' # Needed to install fonts
brew "terraform"
brew "tmux"
brew "wget"

# From custom taps
brew "cloudfleetai/tap/cloudfleet-cli"
brew "ddev/ddev/ddev"
brew "go-task/tap/go-task"

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'

# Apps
cask "acorn"
cask "appcleaner"
cask "applite"
cask "aptakube"
cask "brave-browser"
cask "bruno"
cask "chatgpt"
cask "clickup"
cask "cyberduck"
cask "devutils"
cask "enpass"
cask 'figma'
cask "firefox"
cask "flycut"
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "freelens"
cask "github"
cask "google-chrome"
cask "headlamp"
cask 'helo'
cask "herd"
cask "hiddenbar"
cask "httpie-desktop"
cask "iterm2"
cask "keepassxc"
cask "kubecontext"
cask "logseq"
cask "medis"
cask "mitmproxy"
cask "moom"
cask "ngrok"
cask "nordvpn"
cask "notion"
cask "obsidian"
cask "ollama-app"
cask "openemu"
cask "opera"
cask "orbstack"
cask "orion"
cask "podman-desktop"
cask "prettyclean"
cask "proxyman"
cask "raycast"
cask "rectangle-pro"
cask "sequel-ace"
cask "sf-symbols"
cask "signal"
cask 'slack'
cask "tempbox"
cask "the-unarchiver"
cask "timescribe"
cask "tor-browser"
cask "upscayl"
cask 'visual-studio-code'
cask "whatsapp"
cask "whisky"
