# Taps
tap "cloudfleetai/tap"
tap "ddev/ddev"
tap "go-task/tap"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"

# Binaries
brew "awscli"
brew "bash"
brew "bat"
brew "curl"
brew "coreutils"
brew "eza"
brew "ffmpeg"
brew "gh"
brew "git"
brew "gtk+3"
brew "grep"
brew "hcloud"
brew "helm"
brew "http-server"
brew "httpd"
brew "httpie"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "jq"
brew "kubernetes-cli"
brew "lazygit"
brew "mackup"
brew "mas"
brew "mkcert"
brew "mysql"
brew "ohdear-cli"
brew "openssl@3"
brew "pandoc"
brew "pkg-config"
brew "postgresql"
brew "python"
brew "qrtool"
brew "redis"
brew "s3cmd"
brew "sendme"
brew "speedtest-cli"
brew "sqlite"
brew "svn"
brew "terraform"
brew "tmux"
brew "wget"
brew "zsh"

# From custom taps
brew "cloudfleetai/tap/cloudfleet-cli"
brew "ddev/ddev/ddev"
brew "go-task/tap/go-task"

# Spatie Medialibrary
brew "jpegoptim"
brew "optipng"
brew "pngquant"
brew "svgo"
brew "gifsicle"

# Development
brew "imagemagick"

# Apps
cask "acorn"
cask "appcleaner"
cask "applite"
cask "aptakube"
cask "brave-browser"
cask "bruno"
cask "chatgpt"
cask "clickup"
cask "cyberduck"
cask "devutils"
cask "enpass"
cask "figma"
cask "firefox"
cask "flycut"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro-for-powerline"
cask "font-source-code-pro"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "freelens"
cask "github"
cask "google-chrome"
cask "headlamp"
cask "helo"
cask "herd"
cask "hiddenbar"
cask "httpie-desktop"
cask "iterm2"
cask "keepassxc"
cask "kubecontext"
cask "logseq"
cask "medis"
cask "mitmproxy"
cask "moom"
cask "ngrok"
cask "nordvpn"
cask "notion"
cask "obsidian"
cask "ollama-app"
cask "openemu"
cask "opera"
cask "orbstack"
cask "orion"
cask "podman-desktop"
cask "prettyclean"
cask "proxyman"
cask "raycast"
cask "rectangle-pro"
cask "sequel-ace"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "tempbox"
cask "the-unarchiver"
cask "timescribe"
cask "tor-browser"
cask "upscayl"
cask "visual-studio-code"
cask "whatsapp"
cask "whisky"

mas "Aspen", id: 6475777033
mas "AudioSwitcher", id: 561712678
mas "AusweisApp", id: 948660805
mas "Bitwarden", id: 1352778147
mas "Cleaner One Pro", id: 1133028347
mas "DeltaChat", id: 1462750497
mas "Disk Diag", id: 672206759
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Focalboard", id: 1556908618
mas "GarageBand", id: 682658836
mas "Hand Mirror", id: 1502839586
mas "Harvest", id: 506189836
mas "HP Smart", id: 1474276998
mas "Icon Slate", id: 439697913
mas "JSON Peep", id: 1458969831
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Manico", id: 724472954
mas "Mattermost", id: 1614666244
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Mini Diary", id: 1450296884
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "On The Job", id: 404699732
mas "OS Cleaner Pro", id: 1084211765
mas "Pages", id: 409201541
mas "Postman Interceptor", id: 6460587883
mas "Prime Video", id: 545519333
mas "reMarkable", id: 1276493162
mas "Save to Pocket", id: 1477385213
mas "Simple Web Server", id: 1625925255
mas "SimpleMind", id: 439654198
mas "Slack", id: 803453959
mas "SnailSVNLite", id: 1063090543
mas "Switcheroo", id: 1198084875
mas "Taify", id: 6502970995
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "Trello", id: 1278508951
mas "Ulysses", id: 1225570693
mas "Ulysses", id: 623795237
mas "Wayback Machine", id: 1472432422
mas "WhatsApp", id: 310633997
mas "Xmind", id: 1327661892

go "sigs.k8s.io/kind"
go "mvdan.cc/sh/v3/cmd/shfmt"
